app/controllers/planes_controller.rb

  def index
    @planes = Plane.all
---
SELECT "planes".* FROM "planes"

  def create
    @plane = Plane.new(plane_params)

    respond_to do |format|
      if @plane.save
---
INSERT INTO "planes" ("name", "rows", "columns", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "cool-plane"], ["rows", "A"], ["columns", 5], ["created_at", "2018-08-01 00:20:12.836583"], ["updated_at", "2018-08-01 00:20:12.836583"]]

    def set_plane
      @plane = Plane.find(params[:id])
---
SELECT  "planes".* FROM "planes" WHERE "planes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]