app/controllers/reservations_controller.rb

  def index
    @reservations = Reservation.all
---
SELECT "reservations".* FROM "reservations"

  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("flight_id", "user_id", "reserved", "seat", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["flight_id", 1], ["user_id", 1], ["reserved", false], ["seat", "45A"], ["created_at", "2018-08-01 00:29:42.284598"], ["updated_at", "2018-08-01 00:29:42.284598"]]

    def set_reservation
      @reservation = Reservation.find(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]