app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$10$/h5F7E0VEDgWF/xK4xxui.my8GKZ2kS43ii7PqNv7W4VpMasOHbtO"], ["created_at", "2018-08-01 04:42:36.975585"], ["updated_at", "2018-08-01 04:42:36.975585"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save